cs306/week01/pa01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-30 Mon 20:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Preparation Assessment 02</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bryan Muller" />
</head>
<body>
<div id="content">
<h1 class="title">Preparation Assessment 02</h1>

<div id="outline-container-org76780c5" class="outline-2">
<h2 id="org76780c5"><span class="todo TODO">TODO</span> Answer What is True</h2>
<div class="outline-text-2" id="text-org76780c5">
<p>
If you can truthfully assert any of the following, you know what to do.
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> I know that an algorithm&rsquo;s time efficiency is principally measured as a
function of its input size by counting the number of times its basic
operation is executed.</li>
<li class="on"><code>[X]</code> I understand why it is <b>false</b> to say that a <b>basic operation</b> of an
algorithm is the operation that contributes <b>least</b> toward the algorithm&rsquo;s
running time.</li>
<li class="on"><code>[X]</code> I understand that the established framework for analyzing an algorithm&rsquo;s
time efficiency is primarily grounded in the order of growth of the
algorithm&rsquo;s running time as its input size goes to infinity.</li>
<li class="on"><code>[X]</code> I will ponder the idea that the main tools for analyzing the time
efficiency of a nonrecursive algorithm are to set up a sum expressing the
number of executions of its basic operations and then to ascertain the sum&rsquo;s
order of growth.</li>
<li class="on"><code>[X]</code> I understand how the succinctness of a recursive algorithm may mask its
inefficiency.</li>
<li class="on"><code>[X]</code> I understand that there are several algorithms for computing the
Fibonacci numbers with drastically different efficiencies.</li>
<li class="off"><code>[&#xa0;]</code> I will ponder the idea that the main tools for analyzing the time
efficiency of a recursive algorithm are to set up a recurrence relation
expressing the number of executions of its basic operations and then to
ascertain the solution&rsquo;s order of growth.</li>
<li class="off"><code>[&#xa0;]</code> I know that <b>empirical analysis</b> is applicable to any algorithm.</li>
<li class="off"><code>[&#xa0;]</code> I know why it is <b>false</b> to say that <b>Algorithm Visualization</b>, or the
use of images to convey useful information about algorithms, has three
principal variations.</li>
<li class="off"><code>[&#xa0;]</code> I discovered a web site devoted to algorithm visualization/animation.</li>
</ul>
</div>
</div>

<div id="outline-container-org0461e4c" class="outline-2">
<h2 id="org0461e4c"><span class="todo TODO">TODO</span> Grasp Using Limits for Establishing Rate of Growth</h2>
<div class="outline-text-2" id="text-org0461e4c">
</div>
<div id="outline-container-org0004479" class="outline-3">
<h3 id="org0004479"><span class="done DONE">DONE</span> Fill in the blanks from your Chapter 2 reading.</h3>
<div class="outline-text-3" id="text-org0004479">
<p>
\[\lim_{n \rightarrow \infty} \frac{t(n)}{g(n)} = \left\{\begin{array}{rll}
    0      & \rightarrow &\mbox{the order of growth of $t(n)$ /is smaller than/ the order of growth of $g(n)$}\\
    c>0    & \rightarrow &\mbox{the order of growth of $t(n)$ /is the same as/ the order of growth of $g(n)$}\\
    \infty & \rightarrow &\mbox{the order of growth of $t(n)$ /is larger than/ the order of growth of $g(n)$}\\
     \end{array}\right.\]
</p>
</div>
</div>

<div id="outline-container-org7eba2ad" class="outline-3">
<h3 id="org7eba2ad"><span class="todo TODO">TODO</span> Be prepared to demonstrate this method for the three examples below.</h3>
<div class="outline-text-3" id="text-org7eba2ad">
<p>
\[\begin{array}{lcl}
     t(n) & vs. & g(n) \\ \hline
     10n  & & 2n^2 \\
     n(n+1)/2 & & n^2 \\
     \log_{b}n & & \log_{c}n 
     \end{array}\]
</p>

<p>
Hint: L&rsquo;H&ocirc;pital&rsquo;s rule says:
</p>

<p>
\[\lim_{n \rightarrow \infty} \frac{t(n)}{g(n)} = \lim_{n \rightarrow \infty} \frac{t^{\prime}(n)}{g^{\prime}(n)}\]
</p>
</div>

<div id="outline-container-org4e2b63f" class="outline-4">
<h4 id="org4e2b63f">Example 1</h4>
<div class="outline-text-4" id="text-org4e2b63f">
<p>
\[lim_{n\rightarrow\infty}   \frac{10n}{2n^2}\]
</p>

<p>
\[lim_{n\rightarrow\infty} \frac{5}{x} \]
</p>

<p>
= 0
</p>
</div>
</div>


<div id="outline-container-orgb020161" class="outline-4">
<h4 id="orgb020161">Example 2</h4>
<div class="outline-text-4" id="text-orgb020161">
<p>
\[lim_{n\rightarrow\infty} \frac{n(n+1)/2}{n^2}\]
</p>

<p>
\[lim_{n\rightarrow\infty} \frac{(n^2 + n)/2}{n^2}\]
</p>

<p>
\[lim_{n\rightarrow\infty} \frac{n^2 + n}{2n^2} \]
</p>

<p>
By rules of limits, \[lim_{n\rightarrow\infty} \frac{n^2 + n}{2n^2} \] = 1/2
</p>
</div>
</div>

<div id="outline-container-org459d2ad" class="outline-4">
<h4 id="org459d2ad">Example 3</h4>
<div class="outline-text-4" id="text-org459d2ad">
<p>
\[lim_{n\rightarrow\infty} \frac{log_b n}{log_c n}\]
</p>

<p>
\[\frac{ln c}{ln b} \]
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bryan Muller</p>
<p class="date">Created: 2018-04-30 Mon 20:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
